{
  "main": {
    "name":"Bruce Molina",
    "occupation":"Full Stack Web Developer/Programmer",
    "description": "Analytical and adaptable Web Designer seeking a Backend Software Developer position that will allow me to utilize scripting languages and front-end frameworks to deliver complex web applications and provide seamless solutions for end-users",
    "image":"profilepic.jpg",
    "bio":"Born and raised in NYC, I grew up around technology.  My father was an engineer who built small electronic devices and I was always intrigued by his ingenuity in learning new tech. Through my father, I inherited a passion for tech as well as a focused discipline and a keen attention to detail which has flourished through web development. Through code, I get to flex my brain in the most rewarding way! I find myself hooked on the challenge and the rewards of solving problems elegantly and algorithmically. I am mainly proficient in Python, JavaScript/React HTML and CSS.  I regularly use these as well as other modules/libraries such as Pandas, and Numpy. I'm also a lover of all animals and especially cats!",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "bruce.d.molina@gmail.com",
    "phone": "917-576-9762",
    "address":{
      "street":"32-68 44th Street Apt 3F",
      "city":"New York",
      "state":"NY",
      "zip": "10003"
    },
    "website": "http://www.brucemolina.com",
    "resumedownload": "/resume.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/brucemolina",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/brucemolinanyc",
        "className":"fa fa-github"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/bruce_molina/",
        "className":"fa fa-instagram"
      }
    ]
  },
  "resume":{
    "skillmessage":"The following are a list of my core competencies:",
    "education":[
      {
        "school":"Byte Academy",
        "degree":"Full Stack Python Web Development Immersive Certificate",
        "graduated":"June, 2019",
        "description":"Developed scalable web applications through over 450 hours of solo and collaborative classwork."
      },
      {
        "school":"New York University",
        "degree":"BS in Journalism",
        "graduated":"September, 2003",
        "description":"Coursework in Broadcast Journalism, Finance, Mathematics, Psychology and Computer Science."
      }
    ],
    "work":[
      {
        "company":"Byte Academy",
        "title":"Fullstack Python Web Developer",
        "years":"From Feb. '19 to Jun. '19",
        "description":"Designed and developed fullstack web applications using technologies including Python, Pandas, Numpy, SQLite, Javascript, CSS and React. Collaborated with other developers via Github to establish workflows. Designed and developed complex applications and developed a strong understanding of the Software Development Life Cycle and system design."
      },
      {
        "company":"Google",
        "title":"Community Manager - Local Guides Connect",
        "years":"From Jun. '17 to Dec. '18",
        "description":"Key influencer on the Local Guides team; leading project management efforts in spam fighting, analytics projects and KPI reporting for the Local Guides community and Local Guides Connect website."
      },
      {
        "company":"Euromoney Institutional Investor PLC",
        "title":"Audience Development/Ad Ops Manager",
        "years":"From Jan. '16 to Jun. '17",
        "description":"Analytical lead for all Institutional Investor Journals marketing and advertising campaigns including lead engagement, customer nurturing, retention and new business acquisition."
      }
    ],
    "skills":[
      {
        "name":"Python",
        "level":"70%"
      },
      {
        "name":"Ruby on Rails",
        "level":"70%"
      },
      {
        "name":"ReactJs",
        "level":"80%"
      },
      {
        "name":"JavaScript",
        "level":"60%"
      },
      {
        "name":"Git",
        "level":"80%"
      },
      {
        "name":"HTML5",
        "level":"60%"
      },
      {
        "name":"CSS",
        "level":"40%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Expensify",
        "category":"Expense tracker - Built with React, Redux, Firebase",
        "image":"expensify.jpg",
        "url":"https://bm-react-redux-expenses-app.herokuapp.com/"
      },
      {
        "title":"Decision Maker",
        "category":"Manage your to-do list - Built with React, Javascript",
        "image":"decision-maker.jpg",
        "url":"https://bm-decision-maker-react.herokuapp.com/"
      },
      {
        "title":"Movie Search",
        "category":"Synopsis and info about your favorite films",
        "image":"moviesearch.png",
        "url":"https://moviesearch-api-bm.herokuapp.com/"
      },
      {
        "title":"Terminal Trader",
        "category":"Stock Market Playground - Built with Python, Flask, React",
        "image":"terminaltrader.jpg",
        "url":"http://165.22.5.77"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user":"Kareem Abdul Jabbar"
      },
      {
        "text":"That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user":"Steve Wozniak... impersonator"
      }
    ]
  }
}
